Documents/ОказаниеУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ОказаниеУслуг</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Покупатели</xr:Item>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиНоменклатуры</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Мастер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаборСвойствКлиента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыКлиентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТЧ_ПереченьНоменклатуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Материал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаборСвойств</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВариантыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Себестоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТЧ_Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<Comment>курсы валют</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ОказаниеУслуг/Forms/ФормаДокумента/Ext/Form/Module.bsl
//ОБРАБОТКА ОСНОВНЫХ СОБЫТИЙ ДОКУМЕНТА
 &НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)    
	
	Объект.СуммаДокумента=Объект.ТЧ_ПереченьНоменклатуры.Итог("Сумма")+Объект.ТЧ_Услуги.Итог("Сумма");  
	
КонецПроцедуры 


//Получение актуальных цен для номенклатуры и услуг
 &НаКлиенте
Процедура ТЧ_ПереченьНоменклатурыМатериалПриИзменении(Элемент)
	ТекущаяСтрока=Элементы.ТЧ_ПереченьНоменклатуры.ТекущиеДанные;
	ТекущаяСтрока.Цена=ПолучитьРозничнуюЦену(Объект.Дата, ТекущаяСтрока.Материал);
	ТекущаяСтрока.Себестоимость=ПолучитьСебестоимость(Объект.Дата, ТекущаяСтрока.Материал);
	
	РассчитатьСумму(ТекущаяСтрока);
КонецПроцедуры       
&НаСервере 
Функция ПолучитьСебестоимость(АктуальнаяДата, Номенклатура)
	//1. Получение значения цены средствамифункции из общего модуля
	Результат=Себестоимость(АктуальнаяДата, Номенклатура);
	
	//2.Возврат результата для заполнения формы 
	Возврат Результат;
КонецФункции


&НаКлиенте
Процедура ТЧ_УслугиНоменклатураПриИзменении(Элемент)
	ТекущаяСтрока=Элементы.ТЧ_Услуги.ТекущиеДанные;
	ТекущаяСтрока.Сумма=ПолучитьРозничнуюЦену(Объект.Дата, ТекущаяСтрока.Номенклатура);
	
КонецПроцедуры



//Расчет значения поля "Сумма" в ТЧ
&НаКлиенте
Процедура ТЧ_ПереченьНоменклатурыКоличествоПриИзменении(Элемент)
	
	ТекущаяСтрока=Элементы.ТЧ_ПереченьНоменклатуры.ТекущиеДанные;
	РассчитатьСумму(ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ТЧ_ПереченьНоменклатурыЦенаПриИзменении(Элемент)
	
	ТекущаяСтрока=Элементы.ТЧ_ПереченьНоменклатуры.ТекущиеДанные;
	РассчитатьСумму(ТекущаяСтрока);
	
КонецПроцедуры


//ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
&НаСервере
Функция ПолучитьРозничнуюЦену(АктуальнаяДата,Номенклатура)      
	Результат=РозничнаяЦена(АктуальнаяДата,Номенклатура);
	Возврат Результат;
КонецФункции


&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	Объект.Курс=ПолучитьЗначениеКурса(Объект.Валюта, Объект.Дата);
КонецПроцедуры

&НаСервере
Функция ПолучитьЗначениеКурса(Валюта, Дата) 
	Отбор=Новый Структура("Валюта", Валюта);
	Запись=РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Дата,Отбор);
	Результат=Запись.Кратность;
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ДекорацияНадписьВалютаНажатие(Элемент)
    ФормаРС=ПолучитьФорму("РегистрСведений.КурсыВалют.ФормаСписка");
	
	ФормаРС.Список.Отбор.Элементы.Очистить();
	
	ЭлементОтбора=ФормаРС.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение=ФормаРС.Список.отбор.ДоступныеПоляОтбора.Элементы.Найти("Валюта").Поле;
	ЭлементОтбора.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение=Объект.Валюта;
	ЭлементОтбора.Использование=Истина;
	
	ФормаРС.Открыть();

КонецПроцедуры
